demo-output/website/dafoam/ladder-b/B3_work/fixA_kbounds/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "30000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
21000
(
(0.237200093724544 -0.00281223546717744 0)
(0.255307500655008 -0.000873331096241658 0)
(0.253384218968225 0.000508421261711427 0)
(0.242422804997584 0.000727098811900275 0)
(0.230450657073065 0.000531902630035623 0)
(0.221594689771692 0.000306100115453914 0)
(0.215914670073351 0.00015347256045101 0)
(0.212285053828346 7.57728506330679e-05 0)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
150
(
(0.202035889 0.0002175069967 -5.552999937e-06)
(0.4431459904 0.0004154340131 2.970599962e-05)
(0.5596587062 0.0002435109927 -0.0001056070032)
(0.62183249 -2.354999924e-05 -0.000186528996)
(0.6527944803 -0.0001980980014 -0.0002161379962)
(0.6767228246 -0.0003269269946 -0.0002182150056)
(0.6967076659 -0.0003965659998 -0.0002500539995)
(0.7142959237 -0.0004182090051 -0.0001994049962)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
