demo-output/website/dafoam/ladder-b/B3_work/fixA_kbounds/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2606                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "30000";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
21000
(
2.2962365561088e-05
1.97439059639198e-05
1.81209962737586e-05
1.62861243537919e-05
1.46810530900794e-05
1.35998362717509e-05
1.29594336409239e-05
1.25772477517257e-05
...
)
;

boundaryField
{
    bottomWall
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }
    topWall
    {
        type            nutLowReWallFunction;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
150
(
3.28204764902269e-05
0.000281238899661458
0.000544288022863089
0.000831575581717924
0.00108645255654065
0.00133370138902497
0.00157505121380179
0.00181515441068816
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
150
(
9.9196333352125e-06
0.000112829111906011
0.000350920696828862
0.000682623199426744
0.00110165629581225
0.00158792620308181
0.00211749683191866
0.00266887815422712
...
)
;
    }
    frontAndBack
    {
        type            symmetry;
    }
}


// ************************************************************************* //
